const scheduleData = [
    {
        day: "Понедельник",
        lessons: [
            { time: "08:00-08:45", subject: "Иностранный язык", teacher: "Миронова Л.Ю.", room: "3060-К" },
            { time: "08:00-08:45", subject: "Иностранный язык", teacher: "Миронова Л.Ю.", room: "3060-К" },
            { time: "08:55-09:40", subject: "Обществознание", teacher: "Урбанская В.В.", room: "3601-К" },
            { time: "09:50-10:35", subject: "Математика", teacher: "Яубасова О.А.", room: "1310-К" },
            { time: "10:45-11:30", subject: "Математика", teacher: "Яубасова О.А.", room: "1310-К" },
            { time: "11:40-12:25", subject: "Литература", teacher: "Нежнова Н.А.", room: "3403-К" },
            { time: "12:35-13:20", subject: "Химия", teacher: "Смирнова Г.Н.", room: "2407-К" },
            { time: "13:30-14:15", subject: "История", teacher: "Урбанская В.В.", room: "3601-К" },
            { time: "14:25-15:10", subject: "Иностранный язык", teacher: "Поклонская Т.В.", room: "3601-К" },
            { time: "15:20-16:05", subject: "Иностранный язык", teacher: "Миронова Л.Ю.", room: "3609-К" },
            { time: "16:15-17:00", subject: "Обществознание", teacher: "Урбанская В.В.", room: "3601-К" }
        ]
    },
    {
        day: "Вторник",
        lessons: [
            { time: "08:00-08:45", subject: "Русский язык", teacher: "Нежнова Н.А.", room: "3401-К" },
            { time: "08:55-09:40", subject: "Русский язык", teacher: "Нежнова Н.А.", room: "3401-К" },
            { time: "09:50-10:35", subject: "Математика", teacher: "Яубасова О.А.", room: "1310-К" },
            { time: "10:45-11:30", subject: "Литература", teacher: "Нежнова Н.А.", room: "3403-К" },
            { time: "11:40-12:25", subject: "Химия", teacher: "Смирнова Г.Н.", room: "2407-К" },
            { time: "12:35-13:20", subject: "История", teacher: "Урбанская В.В.", room: "3601-К" },
            { time: "13:30-14:15", subject: "Иностранный язык", teacher: "Миронова Л.Ю.", room: "3060-К" },
            { time: "14:25-15:10", subject: "Иностранный язык", teacher: "Поклонская Т.В.", room: "3601-К" },
            { time: "15:20-16:05", subject: "Обществознание", teacher: "Урбанская В.В.", room: "3601-К" },
            { time: "16:15-17:00", subject: "ОБЖ", teacher: "Черепанов А.К.", room: "2104-К" },
            { time: "17:10-17:55", subject: "География", teacher: "Алмазова Т.В.", room: "3067-К" }
        ]
    },
    // Добавить остальные дни аналогично
];

const homeworkData = [
    { subject: "Математика", task: "Выполнить задания в распечатке." },
    { subject: "Химия", task: "Выполнить тест." }
];
