const scheduleData = [
    {
        day: "Понедельник",
        lessons: [
            {time: "8:00-8:45", subject: "Подгруппа №1\nИностранный язык\nМиронова Л.Ю.", room: "3609-К, 1310-К"},
            {time: "8:55-9:40", subject: "Обществознание\nУрубкасова В.В.", room: "3403-К"},
            {time: "9:50-10:35", subject: "Математика\nЯкобская О.А.", room: "1310-К"},
            {time: "10:55-11:40", subject: "Математика\nЯкобская О.А.", room: "1310-К"},
            {time: "11:50-12:35", subject: "Литература\nНикифорова Т.Э.", room: "3403-К"},
            {time: "12:45-13:30", subject: "Химия\nСмирнова Г.Н.", room: "2407-К"},
            {time: "14:15-15:00", subject: "Подгруппа №2\nИностранный язык\nПокровский Т.В.", room: "3609-К"},
            {time: "15:10-15:55", subject: "История\nУрубкасова В.В.", room: "3601-К"},
            {time: "15:55-16:15", subject: "Обществознание\nУрубкасова В.В.", room: "3601-К"},
            {time: "17:10-17:55", subject: "Обществознание\nУрубкасова В.В.", room: "3601-К"},
            {time: "18:05-18:50", subject: "Обществознание\nУрубкасова В.В.", room: "3601-К"}
        ]
    },
    // Добавьте остальные дни недели...
];

const homeworkData = [
    {
        date: "Понедельник, 09.09.2024",
        assignments: [
            {subject: "Математика", description: "Выполнить задания в распечатке."},
            {subject: "Химия", description: "Выполнить тест."}
        ]
    },
    // Добавьте остальные дни и задания...
];
