const scheduleData = {
    "Понедельник": [
        { time: "8:00-8:45", subject: "Иностранный язык Миронова Л.Ю. / Половинкин Т.В.", room: "3609-К, 3604-К" },
        { time: "8:55-9:40", subject: "Биология Дымкова Г.В. (ЗАМЕНА)", room: "3602-К" },
        { time: "9:50-10:35", subject: "Математика Якобская О.А.", room: "1310-К" },
        { time: "10:35-10:55", subject: "ПЕРЕРЫВ ДЛЯ ПРИЕМА ПИЩИ", room: "" },
        { time: "10:55-11:40", subject: "Математика Якобская О.А.", room: "1310-К" },
        { time: "11:50-12:35", subject: "Литература Некрасова Н.А", room: "3403-К" },
        { time: "12:45-13:30", subject: "Химия Смирнова Г.Н.", room: "2407-К" },
        { time: "13:30-14:15", subject: "ПЕРЕРЫВ ДЛЯ ПРИЕМА ПИЩИ", room: "" },
        { time: "14:15-15:00", subject: "Иностранный язык Миронова Л.Ю. / Половинкин Т.В.", room: "3609-К, 3604-К" },
        // Добавьте остальные уроки
    ],
    /* "Вторник": [
       { time: "8:00-8:45", subject: "Иностранный язык Миронова Л.Ю. / Половинкин Т.В.", room: "3609-К, 3604-К" },
       { time: "8:55-9:40", subject: "Обществознание Урубкасова В.В.", room: "3601-К" },
       { time: "9:50-10:35", subject: "Математика Якобская О.А.", room: "1310-К" },
       { time: "10:35-10:55", subject: "ПЕРЕРЫВ ДЛЯ ПРИЕМА ПИЩИ", room: "" },
       { time: "10:55-11:40", subject: "Математика Якобская О.А.", room: "1310-К" },
       { time: "11:50-12:35", subject: "Литература Некрасова Н.А", room: "3403-К" },
       { time: "12:45-13:30", subject: "Химия Смирнова Г.Н.", room: "2407-К" },
       { time: "13:30-14:15", subject: "ПЕРЕРЫВ ДЛЯ ПРИЕМА ПИЩИ", room: "1310-К" },
       { time: "14:15-15:00", subject: "Иностранный язык Миронова Л.Ю. / Половинкин Т.В.", room: "3609-К, 3604-К" },
        // Добавьте остальные уроки
    ],
    // Добавьте остальные дни недели
    */
};

const homeworkData = [
    { date: "09.09.2024", subject: "Математика", description: "Выполнить задания в распечатке." },
    { date: "09.09.2024", subject: "Литература", description: "Прочитать 'Медный Всадник', по возможности принести в печатном виде." },
    { date: "09.09.2024", subject: "Химия", description: "Выполнить тест в Якласс." },
    { date: "10.09.2024", subject: "Русский язык", description: "Подготовиться к Практической работе (взять тетрадку): 1) Выучить определения (фонетика, орфоэпия, орфография, орфоэпические нормы, литератырныый язык) 2) Выучить слова с ударениями (см. записи в тетради). 3) Выполнить фонетический разбор слов: ВЕСЕЛИТЬСЯ, ЁЛОЧНАЯ, НАЕЗДНИК, НИЧЬЕГО (образец в тетради, проверю у всех)." },
    { date: "10.09.2024", subject: "Обществознание", description: "Сделать схему, смотреть пример в тетради." },
    { date: "10.09.2024", subject: "История", description: "Выучить пройденную тему." },
    { date: "11.09.2024", subject: "Физра", description: "Учебник физической культуры, автор Виленский. Изучить материал страница 165-174 и конспект по этой теме. В распечатано виде." },
    { date: "x.x.2024", subject: "Тетради", description: "Принести практические тетради для предметов." },
];
