const scheduleData = {
    "Понедельник": [
        { time: "8:00-8:45", subject: "Подгруппа №1 <br> Иностранный язык <br> Миронова Л.Ю.", room: "3609-К, 1310-К" },
        { time: "8:55-9:40", subject: "Обществознание\nУрубкасова В.В.", room: "3403-К" },
        { time: "9:50-10:35", subject: "Математика\nЯкобская О.А.", room: "1310-К" },
        // Добавьте остальные уроки
    ],
    "Вторник": [
        { time: "8:00-8:45", subject: "Русский язык\nИванова И.И.", room: "3401-К" },
        // Добавьте остальные уроки
    ],
    // Добавьте остальные дни недели
};

const homeworkData = [
    { date: "09.09.2024", subject: "Математика", description: "Выполнить задания в распечатке." },
    { date: "09.09.2024", subject: "Химия", description: "Выполнить тест." },
    // Добавьте остальные домашние задания
];
