const scheduleData = {
    "Понедельник": [
        { time: "8:00-8:45", subject: "Иностранный язык Миронова Л.Ю. / Половинкин Т.В.", room: "3609-К, 3604-К" },
        { time: "8:55-9:40", subject: "Обществознание Урубкасова В.В.", room: "3601-К" },
        { time: "9:50-10:35", subject: "Математика Якобская О.А.", room: "1310-К" },
        { time: "10:35-10:55", subject: "ПЕРЕРЫВ ДЛЯ ПРИЕМА ПИЩИ", room: "" },
        { time: "10:55-11:40", subject: "Математика Якобская О.А.", room: "1310-К" },
        { time: "11:50-12:35", subject: "Литература Некрасова Н.А", room: "3403-К" },
        { time: "12:45-13:30", subject: "Химия Смирнова Г.Н.", room: "2407-К" },
        { time: "13:30-14:15", subject: "ПЕРЕРЫВ ДЛЯ ПРИЕМА ПИЩИ", room: "1310-К" },
        { time: "14:15-15:00", subject: "Иностранный язык Миронова Л.Ю. / Половинкин Т.В.", room: "3609-К, 3604-К" },
        // Добавьте остальные уроки
    ],
    "Вторник": [
       { time: "8:00-8:45", subject: "Иностранный язык Миронова Л.Ю. / Половинкин Т.В.", room: "3609-К, 3604-К" },
       { time: "8:55-9:40", subject: "Обществознание Урубкасова В.В.", room: "3601-К" },
       { time: "9:50-10:35", subject: "Математика Якобская О.А.", room: "1310-К" },
       { time: "10:35-10:55", subject: "ПЕРЕРЫВ ДЛЯ ПРИЕМА ПИЩИ", room: "" },
       { time: "10:55-11:40", subject: "Математика Якобская О.А.", room: "1310-К" },
       { time: "11:50-12:35", subject: "Литература Некрасова Н.А", room: "3403-К" },
       { time: "12:45-13:30", subject: "Химия Смирнова Г.Н.", room: "2407-К" },
       { time: "13:30-14:15", subject: "ПЕРЕРЫВ ДЛЯ ПРИЕМА ПИЩИ", room: "1310-К" },
       { time: "14:15-15:00", subject: "Иностранный язык Миронова Л.Ю. / Половинкин Т.В.", room: "3609-К, 3604-К" },
        // Добавьте остальные уроки
    ],
    // Добавьте остальные дни недели
};

const homeworkData = [
    { date: "09.09.2024", subject: "Математика", description: "Выполнить задания в распечатке." },
    { date: "09.09.2024", subject: "Химия", description: "Выполнить тест." },
    // Добавьте остальные домашние задания
];
